RSpec.describe FhirPatientGenerator do
    let(:generator) { FhirPatientGenerator.new get_message, generate: false }

    def get_message()
        return <<~MSG
            MSH|^~\&|HL7v2|1319999999|HL7FHIR|1319999999|20161028143312.3521||ADT^A08^ADT_A01|20161028000000002134|P|2.5||||||~ISO IR87||ISO 2022-1994|SS-MIX2_1.20^SS-MIX2^1.2.392.200250.2.1.100.1.2.120^ISO
            EVN||20161028143309|||D100||送信施設
            PID|0001||99990010||テスト^患者１０^^^^^L^I~テスト^カンジャ10^^^^^L^P||19791101|M|||^^^^1510071^JPN^H^東京都渋谷区本町三丁目１２番１号住友不動産西新宿ビル６号館||^PRN^PH^^^^^^^^^03-1234-5678||||||||||||||||||||20161028143309||||||
            NK1|1|テスト^花子^^^^^L^I|^実母^99zzz||^PRN^PH^^^^^^^^^090-xxxx-xxxx||||||||
            PV1|0001|O|01^^^^^C||||||||||||||||||||||||||||||||||||||||||
            DB1|1|PT||N
            OBX|1|NM|9N001000000000001^身長^JC10||165.10|cm^cm^ISO+|||||F||||||||
            OBX|2|NM|9N006000000000001^体重^JC10||51.20|kg^kg^ISO+|||||F||||||||
            AL1|1|DA^薬剤アレルギー^HL70127|11I^ヨード^99zzz|||
            AL1|2|FA^食物アレルギー^HL70127|237^青魚^99zzz|||
            AL1|3|MA^様々なアレルギー^HL70127|351^花粉症^99zzz|||
            IAM|1|LA^花粉アレルギー^HL70127|5A1002216023023^スギ^JC10|MI^軽度^HL70128|目のかゆみ|A^追加^HL70323|||||199601
            IAM|2|FA^食物アレルギー^HL70127|5A1002411023006^ソバ^JC10|MO^中等度^HL70128|湿疹|A^追加^HL70323||||||小学校低学年の頃
            IAM|3|EA^環境アレルギー^HL70127|5A1102700023023^ハウスダスト^JC10|MI^軽度^HL70128|くしゃみ|A^追加^HL70323|||||200302
            IAM|4|DA^薬剤アレルギー^HL70127|106824501^アリナミン^HOT9|MO^中等度^HL70128|のどの渇きが止まらない|A^追加^HL70323|||||20070710
            IN1|1|06^組合管掌健康保険^JHSD0001|06050116|||||||９２０４５|１０|19990514|||||SEL^本人^HL70063
        MSG
    end

    it '#perform' do
        generator.perform
        expect(generator.get_resources.entry.count).to eq 13
    end
end